pythonimport streamlit as st

st.title("--- ΚΑΛΩΣ ΗΡΘΕΣ ΣΤΟ ΤΕΣΤ ---")

# Ερώτηση 1
erwthsh1 = st.radio("1. Σου αρέσει να δουλεύεις με αριθμούς ή σε πιο θεωρητικό επίπεδο", ["προτιμώ να δουλεύω με αριθμούς", "προτιμώ τη θεωρία"])

# Ερώτηση 2
erwthsh2 = st.radio("2. Πώς προτιμάς να δουλεύεις;", ["Μόνoς", "Ομαδικά"])

# Ερώτηση 3
erwthsh3 = st.radio("3. Έχεις υπομονή με τα δύσκολα προβλήματα;", ["Ναι", "Όχι"])

# Κουμπί για το αποτέλεσμα
if st.button("Δες το αποτέλεσμα"):
    st.write("--- ΥΠΟΛΟΓΙΣΜΟΣ ΑΠΟΤΕΛΕΣΜΑΤΟΣ ---")
    if erwthsh1 == "προτιμώ να δουλεύω με αριθμούς" and erwthsh3 == "Ναι":
        st.success("ΣΥΓΧΑΡΙΤΉΡΙΑ! ΕΙΣΑΙ ΜΑΛΑΚΑΣ!!!")
    else:
        st.info("ΣΥΓΧΑΡΙΤΗΡΙΑ ΕΙΣΑΙ ΜΕΓΑΛΟΣ ΜΑΛΑΚΑΣ!!!")
