import streamlit as st

st.title("ΚΑΛΩΣ ΗΡΘΕΣ ΣΤΟ ΤΕΣΤ ΕΡΓΑΣΙΑΚΗΣ ΠΡΟΣΩΠΙΚΟΤΗΤΑΣ")

# Ερώτηση 1
erwthsh1 = st.radio("1. Σου αρέσει να δουλεύεις με αριθμούς ή σε πιο θεωρητικό επίπεδο", ["προτιμώ να δουλεύω με αριθμούς", "προτιμώ τη θεωρία"])

# Ερώτηση 2
erwthsh2 = st.radio("2. Πώς προτιμάς να δουλεύεις;", ["Μόνoς", "Ομαδικά"])

# Ερώτηση 3
erwthsh3 = st.radio("3. Έχεις υπομονή με τα δύσκολα προβλήματα;", ["Ναι", "Όχι"])

# Ερώτηση 4
erwthsh4 = st.radio("4. Σου αρέσει να αναλύεις πολύπλοκα οικονομικά δεδομένα;", ["Ναι", "Όχι"])

# Ερώτηση 5
erwthsh5 = st.radio("5. Ενδιαφέρεσαι να λύνεις προβήματα συμπεριφοράς στο εργασικό σου περιβάλλον;", ["Ναι", "Όχι"])

#Ερώτηση 6
erwthsh6 = st.radio("6. θεωρείς οτι η ψυχολογία σχετίζεται με την αποδοτικότητα; ", ["Ναι", "Όχι"])

#Ερώτηση 7
erwthsh7 = st.radio("7. Σε ενδιαφέρουν τα υλικά κατασκευής και υποστήριξης;", ["Ναι", "Όχι"])

#Ερώτηση 8
erwthsh8 = st.radio("8. θεωρείς την κοινωνική προσφορά πιο σημαντική απο την προσωπική ανάπτυξη.", ["Ναι", "Όχι"])

#Ερώτηση 9
erwthsh9 = st.radio("9. Η βιολογία και οι ζωντανοί οργανισμοί πάντα σου κινούσαν το ενδιαφέρον.", ["Ναι", "Όχι"])

#Ερώτηση 10
erwthsh10 = st.radio("10. Θεωρείς οτι υπάρχουν εργασίες που πρέπει να αμοίβονται καλύτερα απο άλλες", ["Ναι", "Όχι"])





# Κουμπί για το αποτέλεσμα
if st.button("Δες το αποτέλεσμα"):
    st.write("--- ΥΠΟΛΟΓΙΣΜΟΣ ΑΠΟΤΕΛΕΣΜΑΤΟΣ ---")
    if erwthsh1 == "προτιμώ να δουλεύω με αριθμούς" and erwthsh3 == "Ναι":
        st.success("ΣΥΓΧΑΡΙΤΉΡΙΑ! ΕΙΣΑΙ ΜΑΛΑΚΑΣ!!!")
    else:
        st.info("ΣΥΓΧΑΡΙΤΗΡΙΑ ΕΙΣΑΙ ΜΕΓΑΛΟΣ ΜΑΛΑΚΑΣ!!!")
